# Clear Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangulatedShellComponent..::..Clear Method
TriangulatedShellComponent Class See Also
---
Empties the contents of this TriangulatedShellComponent.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Clear()
```

Visual Basic
---
```text
Public Sub Clear
```

Visual C++
---
```text
public:
void Clear()
```

# See Also
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace